tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "ansible"
brew "bat"
brew "deno"
brew "geos"
brew "git"
brew "golangci-lint"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "neovim"
brew "node"
brew "numpy", link: false
brew "proj"
brew "python@3.10"
brew "python@3.9"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
cask "all-in-one-messenger"
cask "brave-browser"
cask "clockify"
cask "cyberduck"
cask "discretescroll"
cask "enpass"
cask "iterm2"
cask "jetbrains-gateway"
cask "karabiner-elements"
cask "maccy"
cask "microsoft-teams"
cask "notunes"
cask "postman"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "teamspeak-client"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
vscode "alexdima.copy-relative-path"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arturock.gitstash"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "coder.coder-remote"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ipatalas.vscode-postfix-ts"
vscode "ipedrazas.kubernetes-snippets"
vscode "LeonQin.auto-insert-comma"
vscode "lokalise.i18n-ally"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "paragdiwan.gitpatch"
vscode "PeterSchmalfeldt.explorer-exclude"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "smockle.xcode-default-theme"
vscode "smulyono.reveal"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tobiaswaelde.clockify-tracker"
vscode "traBpUkciP.vscode-npm-scripts"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "WallabyJs.console-ninja"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "ZainChen.json"
