tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "ansible"
brew "bat"
brew "deno"
brew "geos"
brew "git"
brew "golangci-lint"
brew "htop"
brew "neovim"
brew "node"
brew "numpy", link: false
brew "proj"
brew "python@3.10"
brew "python@3.9"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
cask "all-in-one-messenger"
cask "brave-browser"
cask "discretescroll"
cask "enpass"
cask "iterm2"
cask "jetbrains-gateway"
cask "karabiner-elements"
cask "maccy"
cask "notunes"
cask "raycast"
cask "spotify"
cask "tableplus"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
