tap "homebrew/bundle"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Password manager
brew "pass"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Safe, concurrent, practical language
brew "rust"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Display management tool
cask "betterdisplay"
# Password and credentials manager
cask "enpass"
cask "font-geist-mono"
cask "font-monaspace"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard customiser
cask "karabiner-elements"
# Customise mouse behavior
cask "linearmouse"
# Clipboard manager
cask "maccy"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Voice communication client
cask "teamspeak-client"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Gecko based web browser
cask "zen-browser"
vscode "amodio.toggle-excluded-files"
vscode "asvetliakov.vscode-neovim"
vscode "be5invis.vscode-custom-css"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "daltonmenezes.aura-theme"
vscode "equinusocio.moxer-icons"
vscode "esbenp.prettier-vscode"
vscode "supermaven.supermaven"
